import BreadCrumb from "@/components/modules/breadcrumb/BreadCrumb";
import Footer from "@/components/modules/footer/Footer";
import Navbar from "@/components/modules/navbar/Navbar";
import authUser from "@/utils/authUser";
import React from "react";

const authuser = async () => {
  const user = await authUser();
};
function page() {
  return (
    <>
      <Navbar isLogin={authuser !== null} />
      <BreadCrumb route={"قوانین"} />
      <div className="container m-auto py-10 flex flex-col gap-6 text-gray-500 px-6">
        <p>
          کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و کاربردی{" "}
          <b>قهوه ست</b> به دقت ملاحظه فرمایید.
        </p>
        <p>
          ورود کاربران به قهوه ست هنگام استفاده از پروفایل شخصی، تشویقی،
          ویدئوهای رسانه تصویری قهوه ست و سایر خدمات ارائه شده توسط قهوه ست به
          معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از و
          خدمات قهوه ست است. توجه داشته باشید که ثبت سفارش نیز در هر زمان به
          معنی پذیرفتن کامل کلیه شرایط و قوانین قهوه ست از سوی کاربر است.
        </p>
        <p>لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه قبلی محسوب .</p>
        <span className="font-bold">قوانین عمومی</span>
        <p>
          توجه داشته باشید کلیه اصول و قهوه ست منطبق با قوانین جمهوری اسلامی
          ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و
          متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که
          در قوانین مندرج، و قهوه ست تغییراتی در آینده ایجاد شود، در همین صفحه
          منتشر و به روز رسانی می شود و شما توافق که استفاده مستمر شما از سایت
          به معنی پذیرش هرگونه تغییر است.
        </p>
        <span className="font-bold">تعریف مشتری یا کاربر</span>
        <p>
          هنگامی که شما از و خدمات قهوه ست استفاده سفارش اینترنتی خود را ثبت یا
          خرید و یا به قهوه ست ایمیل این ارتباطات به صورت الکترونیکی انجام و در
          صورتی که درخواست شما با رعایت کلیه اصول و باشد، شما موافقت که قهوه ست
          به صورت الکترونیکی (از طریق پست الکترونیکی، سرویس پیام کوتاه و سایر
          سرویس‌های الکترونیکی) به درخواست شما پاسخ دهد
        </p>
        <p>
          جهت اطلاع رسانی رویدادها، خدمات و سرویس‌های ویژه یا پروموشن‌ها، امکان
          دارد قهوه ست برای اعضای وب سایت ایمیل یا پیامک ارسال نماید. در صورتی
          که کاربران تمایل به دریافت اینگونه ایمیل و پیامک‌ها نداشته باشند،
          می‌توانند عضویت دریافت خبرنامه قهوه ست را در پروفایل خود لغو کنند.
        </p>
      </div>
      <Footer />
    </>
  );
}

export default page;
